Repository: pepr/LearningToProgram2CZ
Catalog: en/align_2013.05.06_23.17.25/complang-czcomplang.tmx
Source language: en
Languages: cs

source: Maybe the designers of those early languages knew some things that have been lost to later designers?
cs: Mohli tvůrci oněch prvních jazyků vědět něco, co tvůrcům pozdějších jazyků uniklo?

source: Finally Lisp has a number of variants.
cs: Na závěr uveďme, že jazyk Lisp má spoustu variant.

source: The versions I have used most are Elisp: the macro language of the Emacs editor, XLISP an experimental OO version and Flavors, a very early experimental OO dialect.
cs: Osobně jsem nejvíce pracoval s verzí Elisp, což je makrojazyk editoru Emacs, XLISP, což je experimentální objektově orientovaná verze a Flavors, což je velmi ranný experimentální objektově orientovaný dialekt.

source: Mainstream Lisp has acquired a standard: Common Lisp and an OO system: CLOS.
cs: Hlavní proud jazyka Lisp se dočkal standardu jménem Common Lisp a objektově orientovaného systému, zvaného CLOS.

source: CLOS is perhaps the most complete OO environment available today, albeit a fairly verbose and extremely complex one.
cs: CLOS patří snad k nejúplnějším objektově orientovaným prostředím, která jsou dnes k dispozici, i když je to prostředí docela ukecané a velmi složité.

source: For that reason I won't even attempt to do an OO Hello world.
cs: Z tohoto důvodu jsem se ani nepokusil o objektově orienovanou verzi programu Hello world.

source: Hello World Note: A Lisp program is itself a list.
cs: Hello World Poznámka: Lispovský program je sám o sobě seznamem.

source: Each element of the list is a list of instructions.
cs: Každý prvek seznamu je seznam insrukcí.

source: The instruction lists can be nested to implement conditionals, loops etc. ( (setq msg "Hello World") (print 'msg))
cs: Seznamy s instrukcemi mohou být zanořené. Tímto způsobem se implementují podmíněné části, cykly atd. ( (setq msg "Hello World") (print 'msg))

source: I first came across Logo on my CP/M micro.
cs: S jazykem Logo jsem se poprvé setkal na svém mikropočítači s CP/M.

source: It was a strange inclusion in the software bundle: a simple programming language designed to teach children about computing using a set of commands for guiding a robot 'turtle' about the floor with a pen tracing the shapes.
cs: Byl to trochu podivný přídavek v rámci dodávaného softwarového balíku. Jde o jednoduchý programovací jazyk, který byl navržen pro výuku programování pro děti. Používá sadu příkazů, kterými se po podlaze vodí robot zvaný želva. Želva má k dispozici tužku, kterou může kreslit různé tvary.

source: This became known as turtle graphics and has been ported to many other languages, including Pascal and Smalltalk.
cs: Tento způsob kreslení vešel ve známost jako želví grafika a byl přenesen do mnoha jiných jazyků, včetně jazyků Pascal a Smalltalk.

source: Logo also had a serious side however and incorporated full List Processing capability and possesses many of the features of Lisp, including the concept of programs being lists in and of themselves.
cs: Logo ale má i svou vážnou tvář. Zahrnuje v sobě plné schopnosti zpracování seznamů a vlastní mnoho rysů jazyka Lisp, včetně konceptu, kdy se program skládá ze seznamů a sám o sobě je seznamem.

source: This makes Logo suitable for teaching (and implementing) Artificial Intelligence techniques but without the mass of parentheses and unusual syntax (from a procedural programmers viewpoint) inherent in Lisp.
cs: Tím se Logo stává vhodným nástrojem pro výuku (a implementování) technik umělé inteligence, osvobozující studenty od hromady závorek a neobvyklé syntaxe (z pohledu procedurálních programátorů), tedy rysů, které jsou vlastní jazyku Lisp.

source: More modern Logo's have OO capability and there are even versions for programming windows - complete with GUI class libraries.
cs: Modernější verze jazyka Logo si přinášejí objektově orientované vlastnosti. Existují dokonce i verze pro programování aplikací s okny (dodávají se s objektovými knihovnami pro tvorbu grafického uživatelského rozhraní).

source: Prolog is different.
cs: Prolog je jiný.

source: Very different!
cs: Velmi jiný!

source: In Prolog you define rules of what you want to happen and leave the system to figure out how the system should do it.
cs: V Prologu definujete pravidla, kterými popisujete, co se má stát, a necháte systém aby si sám našel způsob jak se toho má dosáhnout.

source: This is very intuitive to beginners, and very strange to programmers trained in just about any other language.
cs: Začátečníkům se to jeví jako velmi intuitivní a programátorům, kteří prošli výukou libovolného jiného jazyka, se to zdá velmi podivné.

source: It is a mainstay of artificial intelligence research, especially in Europe and Japan.
cs: Prolog je hlavním pilířem výzkumu umělé inteligence, zejména v Evropě a v Japonsku.

source: Indeed the Japanese, in an attempt to compete with the USA in computing announced in the mid '80s that they would produce a "Fifth Generation" computer based on Prolog by 1990.
cs: Japonci, v rámci pokusu o soupeření s USA na poli počítačů, v osmdesátých letech oznámili, že do roku 1990 vyrobí počítač páté generace, který bude založen na jazyku Prolog.

source: Such a machine never appeared but the Japanese did succeed in dominating computing by the much simpler strategy of building more and better memory chips than anyone else!
cs: Nikdy sice nespatřil světlo světa, ale Japonci uspěli v ovládnutí výpočetní oblasti díky mnohem jednodušší strategii — vyrábějí více a lepších paměťových čipů, než kdokoliv jiný.

source: I played with Prolog because it was available on the VAX computer I used in my first job - I often wondered why?
cs: S jazykem Prolog jsem si mohl pohrát, protože byl k dispozici na počítači VAX, který jsem používal ve svém prvním zaměstnání. Vždycky jsem se divil, proč tam ten Prolog je.

source: We certainly never used it in any kind of production capacity.
cs: Zcela určitě jsme jej nikdy nepoužili při řešení úkolů, kterými jsme se živili.

source: I've never really written any serious code in Prolog but the whole concept fascinates me.
cs: V Prologu jsem vlastně nikdy nenapsal nějaký důležitý program, ale jeho celková koncepce mne fascinuje.

source: Maybe someday I'll find a real use for it, until then I'll keep playing when the mood takes me.
cs: Jednoho dne pro něj možná najdu nějaké opravdové použití. Do té doby si s ním budu zatím jen hrát — když mě přepadne špatná nálada.

source: Smalltalk is Objects.
cs: Smalltalk, to jsou objekty.

source: Everywhere.
cs: Všude.

source: Always.
cs: Vždycky.

source: Although Simula 67 is generally held to be the first OO language, Smalltalk was the one that really got the ball going in the wider world.
cs: Ačkoliv se uznává, že prvním objektově orientovaným jazykem byla Simula 67, prvním opravdu rozšířeným se stal Smalltalk.

source: During the 1970's Smalltalk evolved into what was to be the definitive OO environment: Smalltalk 80.
cs: Během 70. let se Smalltalk vyvinul v něco, co se mělo stát úplným objektově orientovaným prostředím: Smalltalk 80.

source: If you want to sample Smalltalk 80 download a copy of Squeak from Disney.com.
cs: Pokud si chcete vyzkoušet Smalltalk 80, stáhněte si kopii Squeak z disney.com.

source: The environment is a faithful copy of the Smalltalk 80 programming environment, including the GUI which is distinctly eccentric by modern standards but was the catalyst for the Mac and windows etc.
cs: Jeho prostředí je věrnou kopií programového prostředí Smalltalk 80, včetně GUI. Jeho grafické uživatelské rozhraní je sice z dnešního pohledu zjevně excentrické, ale stalo se katalyzátorem pro vznik prostředí počítačů Macintosh, pro vznik Windows...

source: My preferred Smalltalk implementation is Dolphin Smalltalk for Win95.
cs: Mou preferovanou implementací jazyka Smalltalk je Dolphin Smalltalk pro Windows 95.

source: This is unusual in that the development environment is free but if you want to distribute programs as EXEs then you need to buy a deployment kit.
cs: Neobvyklé na něm je to, že vývojové prostředí je k dispozici zdarma. Pokud ale chcete výsledný program dodávat v podobě EXE, musíte si koupit nástroj pro jeho vytvoření.

source: This seems to be a reasonable alternative to shareware as a try-before-you-buy scheme.
cs: Zdá se, že je to rozumná alternativa k shareware v rámci přístupu vyzkoušej si, než si koupíš.

source: The environment is good and the HTML format documentation and tutorial is very readable.
cs: Vývojové prostředí je dobré a dokumentace i učebnice ve formátu HTML jsou velmi čtivě napsané.

source: There is a support forum too.
cs: Existuje i skupina, která se zabývá podporou.

source: Smalltalk fans love the consistency of the language (as I said, everything is an object) and its small set of syntactic constructs - making it easy to learn.
cs: Fanoušci jazyka Smalltalk si libují v konzistentnosti jazyka (jak jsem řekl, vše je objekt) a v tom, že existuje jen malá množina syntaktických konstrukcí — odtud vyplývá snadné naučení se jazyku.

source: At least thats the idea - it took me 3 attempts with 2 different environments to get my head around it.
cs: To má tedy být základní myšlenka. Osobně jsem musel absolvovat tři pokusy ve dvou různých prostředích, než mi to vlezlo do hlavy.

source: At times Smalltalk rivals C and Perl in the use of obscure and overloaded symbols (@,#,[,], etc).
cs: Občas je Smalltalk zdatným soupeřem jazyků C a Perl — při používání záhadných a přetížených symbolů (@, #, [, ], atd.).

source: Hello World message := string new: "Hello World". message print.
cs: Hello World message := string new: "Hello World". message display.

source: If you want to comment on these views please mail me.
cs: Pokud k uvedeným pohledům chcete doplnit nějaké připomínky, napište mi, prosím.

source: Back to the top
cs: (..., ale anglicky.) [ zpět ]
